app/controllers/reynolds_marketings_controller.rb

SELECT "reynolds_marketings".* FROM "reynolds_marketings"
---
  def index
    @reynolds_marketings = ReynoldsMarketing.all

SELECT "reynolds_marketings".* FROM "reynolds_marketings" WHERE "reynolds_marketings"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @reynolds_marketing = ReynoldsMarketing.find(params[:id])

INSERT INTO "reynolds_marketings" ("created_at", "email", "first_name", "frequents_anderson", "frequents_fishers", "frequents_lebanon", "frequents_mooresville", "frequents_muncie", "frequents_nicholasville", "frequents_sheridan", "frequents_xenia", "last_name", "phone", "receive_ag_parts", "receive_ag_sales", "receive_ag_service", "receive_ag_tech_updates", "receive_agronomy_updates", "receive_community_events_updates", "receive_cwp_parts", "receive_cwp_sales", "receive_cwp_service", "receive_emails", "receive_golf_parts", "receive_golf_sales", "receive_golf_service", "receive_irrigation_updates", "receive_lawn_parts", "receive_lawn_sales", "receive_lawn_service", "receive_rental_updates", "receive_texts", "receive_toy_updates", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @reynolds_marketing = ReynoldsMarketing.new(params[:reynolds_marketing])

    respond_to do |format|
      if @reynolds_marketing.save